Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G51B.tmx
Source language: en_us
Languages: zh_cn

source: Jack Welch 17
zh_cn: 杰克韦尔奇自传17

source: She took me to the bleachers in Fenway Park to watch Ted Williams play left field for the Boston Red Sox.
zh_cn: 她载我到芬威公园的露天看台去看特德威廉姆斯在波斯顿红袜队打左路。

source: She'd pick me up at school in the early afternoon and drive me over to the country club so I could get a head start on the other caddies.
zh_cn: 她下午很早就来接我去乡村俱乐部，这样我就可以比其他的球童更早到达。

source: A devout Catholic, she'd drive me to St. Thomas the Apostle Church so I could serve the six A.M. mass as an altar boy, with her praying in the first row in the right pew.
zh_cn: 作为一个虔诚的天主教徒，她载我到传教士教堂—圣.托马斯教堂，让我在早上六点作为圣童迎接大批教徒，她也会坐在右边第一排的条凳上祷告。

source: She became my most enthusiastic cheerleaders, calling up the local newspapers and asking them to carry items about my small triumphs, from graduating from the University of Massachusetts to earning my Ph.D.
zh_cn: 她为我所取得的小小成绩比如从马塞诸斯州大学拿到了博士学位，给当地报纸打电话爆料，成为我最热心的啦啦队长。

source: Then she'd paste each clipping into a big scrapbook.
zh_cn: 她还将这些报道收集做成一大本简报。

source: She was shame less that way.
zh_cn: 她很自豪地这样做。

source: My mother was clearly the disciplinarian in the family.
zh_cn: 我的妈妈毫无疑问是家里最要求严苛的人。

source: When my father once caught me on his train headed home after I'd skipped school to celebrate St. Patrick's Day in South Boston, he didn't say anything in front my friends¡ªeven though all of us were juiced on some cheap 50-cents-a-bottle muscatel.
zh_cn: 当我翘课去南波斯顿庆祝圣父之日被爸爸在火车上碰到时，他不但没有当着朋友的面责备我，反而给我们每人一瓶大约50美分的葡萄酒。

source: Instead he simply told my mother, who confronted me and doled out the punishment.
zh_cn: 相反地，他只是简要地跟妈妈提了一下，妈妈立刻果断做出了对我的处罚。

source: Another time, I cut altar boy practice to play hockey on the frozen pond at Mack Park near my home.
zh_cn: 还有一次，我提前结束了圣童训练去我家附近的马克公园真冰场玩曲棍球。

source: During the game, I fell through the ice and got completely soaked.
zh_cn: 在球赛中我摔进了冰块中浑身湿透了。

source: To try to cover up what happened, I stripped off my wet clothes and hung them on a tree over a fire we built. We shivered in the January cold waiting for our clothes to dry.
zh_cn: 为了掩饰我溜出去玩的行动，我脱下湿漉漉的外套挂在我们生的篝火上的树枝上烤着，在萧瑟的寒风中我们哆嗦着等待外套烤干。

source: It was, I thought, a rather clever cover-up¡ªuntil I walked through the front door.
zh_cn: 我自信地以为能够伪装成功，直到开门走近门廊。

source: It took a second for my mother to smell the smoke on my clothes.
zh_cn: 妈妈立刻就闻到我身上的烟味。

source: Ducking altar boy practice was a big deal to someone who hung a crucifix on the wall, prayed the rosary, and considered Father James Cronin, the longtime pastor of my church, a saint.
zh_cn: 对于将十字架挂在墙上、用念珠祷告并将在我们教会很长时间的牧师--詹姆斯神父当作圣人的她来说，圣童的训练是非常重要的大事。

source: So she sat me down, forced out a confession, and the delivered her own penance. Whacking me with a damp shoe she'd just taken off my foot.
zh_cn: 她要我坐下，认真忏悔，并采用了她自己的惩罚方式—用我刚脱下的湿漉漉的鞋狠狠地打我。
